syntaks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-20 ma. 13:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Syntaks</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="tarjei" />
</head>
<body>
<div id="content">
<h1 class="title">Syntaks</h1>
<p>
Det følgende er en blanding av egenskrevet materiale og materiale sterkt inspirert av <a href="https://learnxinyminutes.com/docs/python/">https://learnxinyminutes.com/docs/python/</a>, gitt ut under en <a href="https://creativecommons.org/licenses/by-sa/3.0/deed.no">Creative Commons-DelPåSammeVilkår</a>-lisens. Det følgende er derfor lisensiert på tilsvarende måte.
</p>

<div id="outline-container-org10ccb75" class="outline-2">
<h2 id="org10ccb75">Kommentarer</h2>
<div class="outline-text-2" id="text-org10ccb75">
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">Enkeltlinjekommentarer starter etter #-tegnet</span>
<span class="org-variable-name">a</span> = 42 <span class="org-comment-delimiter"># </span><span class="org-comment">og de kan komme sammen med en vanlig programlinje</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Blokkommanterer g&#229;r</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">over flere linjer</span>

<span class="org-doc">""" De kan ogs&#229; skrives ved &#229; bruke trippelsitater, enten</span>
<span class="org-doc">    med "- eller '-tegnene.</span>
<span class="org-doc">"""</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org798c9b4" class="outline-2">
<h2 id="org798c9b4">Tall og primitive datatyper</h2>
<div class="outline-text-2" id="text-org798c9b4">
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">Tall evaluerer til seg sj&#248;l</span>

42 <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; 42</span>
3.14 <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; 3.14</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Utregninger er som forventet</span>
1 + 1 <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; 2</span>
9 - 2 <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; 7</span>
21 * 7 <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; 147</span>
21 / 7 <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; 3</span>
3 ** 3 <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; 27</span>
25 // 7 <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; 3 # // gir heltallsdivisjon med svaret rundet ned</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Vi finner resten i et delestykke med modulo-operatoren</span>
25 % 7 <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; 4</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">her er 25 = 3 * 7 + 4, alts&#229; er 25 // 7 = 3 med 4 i rest</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Regnerekkef&#248;lge kan endres med parenteser</span>
(1 + 7) * 4 <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; 32</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Boolske operatorer</span>
<span class="org-constant">True</span> <span class="org-keyword">and</span> <span class="org-constant">False</span> <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; False</span>
<span class="org-constant">False</span> <span class="org-keyword">or</span> <span class="org-constant">True</span> <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; True</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">vi negerer med not</span>
<span class="org-keyword">not</span> <span class="org-constant">True</span> <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; False</span>
<span class="org-keyword">not</span> <span class="org-constant">False</span> <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; True</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">likhet sjekkes med ==</span>
<span class="org-constant">True</span> == <span class="org-constant">True</span> <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; True</span>
<span class="org-constant">True</span> == <span class="org-constant">False</span> <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; False</span>
<span class="org-constant">False</span> == <span class="org-constant">False</span> <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; True</span>
1 == 1 <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; True</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">ulikhet sjekkes med !=</span>
1 != 1 <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; False</span>
<span class="org-constant">True</span> != <span class="org-constant">False</span> <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; True</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">st&#248;rrelser kan sammenlignes</span>
1 &lt; 2 <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; True</span>
1 &gt; 2 <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; False</span>
1 &lt; 1 <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; False</span>
1 &lt;= 1 <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; True</span>
1 &gt; 1 <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; False</span>
1 &gt;= 1 <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; True</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Tekststrenger</span>
<span class="org-string">'kan lages med "-tegnet'</span>
<span class="org-string">"eller '-tegnet"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Strenger kan legges sammen</span>
<span class="org-string">"Hei, "</span> + <span class="org-string">"verden!"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; "Hei, verden!"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Strenger kan ganges med heltall</span>
<span class="org-string">"Hei!"</span> * 3 <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; "Hei!Hei!Hei!"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Strenger oppf&#248;rer seg som en liste av bokstaver</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">Hei, verden!"[2] # -&gt; "i"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Vi kan finne lengden av en streng</span>
<span class="org-builtin">len</span>(<span class="org-string">"Hei,verden!"</span>) <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; 11</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Vi kan &#171;formatere&#187; strenger ved &#229; lage f-strenger</span>
<span class="org-variable-name">a</span> = <span class="org-string">"eple"</span>
<span class="org-variable-name">b</span> = <span class="org-string">"appelsin"</span>

f<span class="org-doc">"Mine favorittfrukter er {a} og {b}."</span> <span class="org-comment-delimiter"># </span><span class="org-comment">"&gt; "Mine favorittfrukter er eple og appelsin."</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7a3c92a" class="outline-2">
<h2 id="org7a3c92a">Variabler og samlinger</h2>
<div class="outline-text-2" id="text-org7a3c92a">
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">Python har en print-funksjon</span>
<span class="org-keyword">print</span>(<span class="org-string">"Afrikanske svaler er ikke trekkfugler."</span>) <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; Afrikanske svaler er ikke trekkfugler</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Vi kan motta en streng fra brukeren via input</span>
<span class="org-variable-name">variabelnavn</span> = <span class="org-builtin">input</span>(<span class="org-string">"En prompt til brukeren: "</span>)

<span class="org-comment-delimiter"># </span><span class="org-comment">lister lagrer sekvenser av elementer</span>
<span class="org-variable-name">liste</span> = []
<span class="org-comment-delimiter"># </span><span class="org-comment">vi kan opprette en liste med elementer</span>
<span class="org-variable-name">annen_liste</span> = [2, 3, 4, 5]

<span class="org-comment-delimiter"># </span><span class="org-comment">legg til elementer i enden av en liste med append</span>
liste.append(2)  <span class="org-comment-delimiter"># </span><span class="org-comment">liste er n&#229; [2]</span>
liste.append(5)  <span class="org-comment-delimiter"># </span><span class="org-comment">liste er n&#229; [2, 5]</span>
liste.append(42) <span class="org-comment-delimiter"># </span><span class="org-comment">liste er n&#229; [2, 5, 42]</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">returner og fjern det siste elementet med pop</span>
liste.pop() <span class="org-comment-delimiter">#</span><span class="org-comment">-&gt; 42 # liste er n&#229; [2, 5]</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">vi legger inn et par verdier til</span>
liste.append(5) <span class="org-comment-delimiter"># </span><span class="org-comment">liste er n&#229; [2, 5, 5]</span>
liste.append(42) <span class="org-comment-delimiter"># </span><span class="org-comment">liste er n&#229; [2, 5, 5, 42]</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">vi adressere elementer i ei liste med indeks</span>
liste[0] <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; 2 # 0 er indeksen til det f&#248;rste elementet</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">vi kan gi nye verdier til elementene ved &#229; bruke indeksering</span>
<span class="org-variable-name">liste</span>[1] = 7 <span class="org-comment-delimiter"># </span><span class="org-comment">liste er n&#229; [2, 7, 5, 42]</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">vi kan se p&#229; det siste elementet</span>
liste[-1] <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; 5</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">om vi fors&#248;ker &#229; se utenfor ei liste, f&#229;r vi en IndexError</span>
liste[3] <span class="org-comment-delimiter"># </span><span class="org-comment">hever en IndexError</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">i kan hente ut deler av ei liste med slice-notasjon</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">(for de som har R1, er dette et lukket/&#229;pent-intervall</span>
liste[1:3] <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; [7, 5]</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Hoppe over begynnelsen</span>
liste[1:] <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; [7, 5, 42]</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Hoppe over slutten</span>
liste[:-1] <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; [2, 7, 5]</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Hoppe over annethvert element</span>
liste[::2] <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; [2, 5]</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Reverser lista</span>
liste[::-1] <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; [42, 5, 7, 2]</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Slicer oppgis alts&#229; som listenavn[start_inkludert:slutt_ekskludert:steg]</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Legg sammen to lister med +</span>
annen_liste + liste <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; [2, 3, 4, 5, 2, 7, 42] # merk at begge listene er uendrede</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Utvid en liste med extend</span>
liste.extend(annen_liste) <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; [2, 7, 42, 2, 3, 4, 5] # liste er n&#229; endret</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Fjern f&#248;rste tilfellet av en verdi</span>
liste.remove(3) <span class="org-comment-delimiter"># </span><span class="org-comment">liste er n&#229; [2, 7, 42, 2, 4, 5]</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">liste.remove(3) # hever en ValueError siden 3 ikke lenger er i lista</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Vi kan sette inn et element ved &#248;nsket indeks med insert</span>
liste.insert(4, 3) <span class="org-comment-delimiter"># </span><span class="org-comment">liste er n&#229; [2, 7, 42, 2, 3, 4, 5] igjen</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">F&#229; indeksen av det f&#248;rste elementet funnet</span>
liste.index(42)
<span class="org-comment-delimiter"># </span><span class="org-comment">liste.index(43) # Hever en ValueError siden 43 ikke er i liste</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Sjekk om et element er i en liste med in</span>
42 <span class="org-keyword">in</span> liste <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; True</span>
43 <span class="org-keyword">in</span> liste <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; False</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">F&#229; lengden til en liste med len</span>
<span class="org-builtin">len</span>(liste) <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; 7</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Vi kan returnere en sortert liste</span>
<span class="org-builtin">sorted</span>(liste) <span class="org-comment-delimiter"># </span><span class="org-comment">-&gt; [2, 2, 3, 4, 5, 5, 7, 42]</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">liste er fortsatt [2, 7, 5, 42, 3, 2, 4, 5]</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">om vi &#248;nsker &#229; endre liste &#171;in place&#187;, kan vi bruke sort()</span>
liste.sort() <span class="org-comment-delimiter"># </span><span class="org-comment">liste er n&#229; [2, 2, 3, 4, 5, 5, 7, 42]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfb3934a" class="outline-2">
<h2 id="orgfb3934a">Tupler</h2>
</div>
</div>
</body>
</html>
